Чистая/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
</mdclass:Catalog>

Чистая/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Чистая/src/Catalogs/Контрагенты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	Если Элементы.Тип.ВыделенныйТекст = "Физическое лицо" Тогда
		Элементы.КПП.Видимость = Ложь;
	Иначе
		Элементы.КПП.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ТекущийОбъект.Тип = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		Элементы.КПП.Видимость = Ложь;
	Иначе
		Элементы.КПП.Видимость = Истина;
	КонецЕсли; 
	
	ЗапретРасшифровкиНаименования = ЗначениеЗаполнено(Объект.ПолноеНаименование) И Объект.ПолноеНаименование = РасшифровкаТекста(Объект.Наименование);
	
	
		
		
		
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Если НЕ ЗапретРасшифровкиНаименования Тогда
	
		Если Элементы.Тип.ВыделенныйТекст = "Юридическое лицо" Тогда
		
			

			Объект.ПолноеНаименование = РасшифровкаТекста(Объект.Наименование);
		
		КонецЕсли;
	КонецЕсли;
		
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РасшифровкаТекста(ТекстРасшифровки)
	
	РазбитаяСтрока = СтрРазделить(ТекстРасшифровки, " .,!?", Ложь);
	
	Если РазбитаяСтрока.Найти("АО") = 0 ИЛИ РазбитаяСтрока.Найти("ао") = 0 Тогда
		РазбитаяСтрока.Установить(0, "Акционерное общество");
		
	ИначеЕсли РазбитаяСтрока.Найти("ООО") = 0 ИЛИ РазбитаяСтрока.Найти("ооо") = 0 Тогда
		РазбитаяСтрока.Установить(0, "Общество с ограниченной ответственностью");
	ИначеЕсли РазбитаяСтрока.Найти("ИП") = 0 ИЛИ РазбитаяСтрока.Найти("ип") = 0 Тогда
		РазбитаяСтрока.Установить(0, "Индивидуальный предприниматель");
		
	КонецЕсли;
	Возврат СтрСоединить(РазбитаяСтрока, " ");

КонецФункции

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	Ответ = ПроверкаИНН();
	Если Ответ[0] = Ложь Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Ответ[1];
		Сообщение.Поле = "Объект.ИНН";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

 


&НаСервере
Функция ПроверкаИНН()
	
	ЮрЛицо = Объект.Тип = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	ИНН = Объект.ИНН;
	Возврат ПроверкаИННСервер.КорректныйИНН(ИНН, ЮрЛицо);
	
КонецФункции
